tutorials/fluids/cylinderInChannel/overset/movingCylinder/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     fluidFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         80;

deltaT          0.02;

writeControl    timeStep;

writeInterval   5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  9;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep no;

maxCo 10;

functions
(
   forces
   {
       type                forces;
       functionObjectLibs  ( "libforces.so" );
       outputControl       timeStep;
       outputInterval      1;
       patches             (CylinderWall);
       pName               p;
       UName               U;
       rhoName             rhoInf;
       log                 true;
       rhoInf              1;
       CofR                (0.5 0.1 0);
   }
);



// ************************************************************************* //
